:PROPERTIES:
:ID:       4C23F0BD-362D-4153-A1F3-8E179A33FF19
:mtime:    20240914122852
:ctime:    20240914115641
:END:
#+title: Serverless Computing
* Table of Contents :toc_2_gh:
- [[#trace][Trace]]
- [[#bench][Bench]]
- [[#cold-start][Cold Start]]
  - [[#security][Security]]
  - [[#salus-efficient-security-support-for-cxl-expanded-gpu-memory][Salus: Efficient Security Support for CXL-Expanded GPU Memory]]
  - [[#disaggregation][Disaggregation]]
  - [[#eco][Eco]]

* Trace
*** [[https://www.usenix.org/conference/atc20/presentation/shahrad][Serverless in the wild: Characterizing and optimizing the serverless workload at a large cloud provider]]
+ BibTex:
+ Conference:
+ Cited by: 610 [2024-09-22]
+ [[][Source code]]
* Bench
*** [[https://dl.acm.org/doi/10.1145/3419111.3421280][Characterizing serverless platforms with serverlessbench]]
+ BibTex:
+ Conference: SOCC
+ Cited by: 200 [2024-09-22]
+ [[https://github.com/SJTU-IPADS/ServerlessBench][Source code]]

  
* Cold Start
*** [[https://dl.acm.org/doi/10.1145/3617232.3624871][RainbowCake: Mitigating Cold-starts in Serverless with Layer-wise Container Caching and Sharing]]
+ BibTex: [[id:4B9E12AA-E6BA-4E0C-91B0-EC3771E7DFBE][yu2024rainbowcake]]
+ Conference: Asplos 24
+ Cited by: 4 [2024-09-14]
+ [[][Source code]]

*** [[https://www.usenix.org/conference/atc19/presentation/fouladi][From Laptop to Lambda:Outsourcing Everyday Jobs to Thousands of Transient Functional Containers]]
+ BibTex:
+ Conference: ATC 2019
+ Cited by: 248 [2024-09-15]
+ [[][Source code]]

*** [[https://dl.acm.org/doi/10.1145/3419111.3421277][Kappa: A Programming Framework for Serverless Computing]]
+ BibTex: [[id:5FC0139F-2EFF-4C28-9A8F-A52138D9EB5E][zhang2020kappa]]
+ Conference: SOCC 2020
+ Cited by: 82 [2024-09-15]
+ [[][Source code]]

*** [[https://www.usenix.org/conference/nsdi24/presentation/zhang-zili-jolteon][Jolteon: Unleashing the Promise of Serverless for Serverless Workflows]]
+ BibTex: [[id:AF8B2904-8B37-404B-BB76-CCD9495D81E7][zhang2024jolteon]]
+ Conference: NSDI 2024
+ Cited by: 1 [2024-09-15]
+ [[][Source code]]

*** [[https://www.usenix.org/conference/osdi22/presentation/mahgoub][ORION and the Three Rights: Sizing, Bundling, and Prewarming for Serverless DAGs]]
+ BibTex:
+ Conference: OSDI 2022
+ Cited by: 81 [2024-09-16]
+ [[][Source code]]

*** [[https://dl.acm.org/doi/10.1145/3582016.3582063][Tpp: Transparent page placement for cxl-enabled tiered-memory]]
+ BibTex: [[id:B8D4C6EC-D343-45B4-B9AC-76CE77A44A81][maruf2023tpp]]
+ Conference: ASPLOS 2023
+ Cited by: 156 [2024-09-17]
+ [[][Source code]]

*** [[https://dl.acm.org/doi/10.1145/3600006.3613167][Memtis: Efficient memory tiering with dynamic page classification and page size determination]]
+ BibTex: [[id:24F928F2-DFA2-465A-A2A8-F81DE5F5D275][lee2023memtis]]
+ Conference: SOSP 2023
+ Cited by: 20 [2024-09-17]
+ [[https://github.com/cosmoss-jigu/memtis][Source code]]

*** [[https://www.usenix.org/conference/atc17/technical-sessions/presentation/amit][Optimizing the TLB Shootdown Algorithm with Page Access Tracking]]
+ BibTex:
+ Conference: ATC 2017
+ Cited by: 96 [2024-09-18]
+ [[][Source code]]

*** [[https://www.usenix.org/conference/osdi24/presentation/chen-lei][A Tale of Two Paths: Toward a Hybrid Data Plane for Efficient Far-Memory Applications]]
+ BibTex:[[id:7B734F2F-B6A5-441A-B7A2-735FE653EDD2][chen2024tale]]
+ Conference: OSDI 2024
+ Cited by: 0 [2024-09-20]
+ [[][Source code]]

*** [[https://www.usenix.org/conference/nsdi23/presentation/qiao][Hermit: Low-Latency, High-Throughput, and Transparent Remote Memory via Feedback-Directed Asynchrony]]
:LOGBOOK:
CLOCK: [2024-09-27 Fri 00:59]--[2024-09-27 Fri 02:40] =>  1:41
:END:
+ BibTex: [[id:67686589-F6AA-43B8-A184-044C91C7EAB5][qiao2023hermit]]
+ Conference: NSDI 2023
+ Created: [2024-09-26 22:02:12]
+ Cited by: 19 [2024-09-26]
+ [[https://github.com/uclasystem/hermit][Source code]]

*** [[https://www.usenix.org/conference/atc24/presentation/tabatabai][FBMM: Making Memory Management Extensible With Filesystems]]
+ BibTex:
+ Conference: ATC 2024
+ Cited by: 0 [2024-09-20]
+ [[][Source code]]

*** [[https://www.usenix.org/conference/osdi20/presentation/ruan][AIFM: High-Performance, Application-Integrated Far Memory]]
+ BibTex:
+ Conference: OSDI 2020
+ Cited by: 193 [2024-09-20]
+ [[][Source code]]

*** [[https://www.usenix.org/conference/atc24/presentation/xu-dong][FlexMem: Adaptive Page Profiling and Migration for Tiered Memory]]
+ BibTex: [[id:F5CE2620-5307-4E6E-8E0A-678180EA0285][xu2024flexmem]]
+ Conference:
+ Cited by: 0 [2024-09-20]
+ [[][Source code]]

*** [[https://dl.acm.org/doi/10.1145/3575693.3578835][Pond: CXL-Based Memory Pooling Systems for Cloud Platforms]]
+ BibTex: [[id:928CECC1-02C7-4D48-AF47-547998928B03][li2023pond]]
+ Conference: Asplos 2023
+ Cited by: 217 [2024-09-22]
+ [[https://github.com/MoatLab/Pond][Source code]]

*** [[https://dl.acm.org/doi/10.1145/3503222.3507750][IceBreaker: Warming Serverless Functions Better with Heterogeneity]]
+ BibTex: [[id:5B494E2D-14E1-4BC5-90B4-AA2B197E0BE4][roy2022icebreaker]]
+ Conference: Asplos 2022
+ Cited by: 101 [2024-09-22]
+ [[][Source code]]

*** [[https://dl.acm.org/doi/10.1145/3445814.3446757][FaasCache: keeping serverless computing alive with greedy-dual caching]]
+ BibTex:
+ Conference:
+ Cited by: 175 [2024-09-22]
+ [[][Source code]]

*** [[https://www.usenix.org/conference/osdi23/presentation/wei-rdma][No Provisioned Concurrency: Fast RDMA-codesigned Remote Fork for Serverless Computing]]
+ BibTex: [[id:2A3D2F58-5521-429A-B4EE-C5930995355E][wei2023no]]
+ Conference: OSDI 2023
+ Cited by: 24 [2024-09-24]
+ [[https://github.com/ProjectMitosisOS][Source code]]

*** [[https://www.usenix.org/conference/atc21/presentation/kotni][Faastlane: Accelerating function-as-a-service workflows]]
+ BibTex:
+ Conference:
+ Cited by: 97 [2024-09-24]
+ [[][Source code]]

*** [[https://dl.acm.org/doi/10.1145/3503222.3507732][Serverless computing on heterogeneous comput- ers.]]
+ BibTex:
+ Conference: Asplos 2022
+ Cited by: 59 [2024-09-24]
+ [[][Source code]]

*** [[https://dl.acm.org/doi/10.1145/3373376.3378512][Catalyzer: Sub-millisecond startup for serverless computing with initialization-less booting]]
+ BibTex:
+ Conference: Asplos 2020
+ Cited by: 268 [2024-09-24]
+ [[][Source code]]

*** [[https://dl.acm.org/doi/10.1145/3445814.3446714][Benchmarking, analysis, and optimization of serverless function snapshots]]
+ BibTex:
+ Conference: Asplos 2021
+ Cited by: 177 [2024-09-24]
+ [[][Source code]]

*** [[https://dl.acm.org/doi/10.1145/3361525.3361535][On the faas track: Building stateful distributed applications with serverless architectures]]
+ BibTex:
+ Conference: Middleware 2019
+ Cited by: 130 [2024-09-24]
+ [[][Source code]]

*** [[https://dl.acm.org/doi/abs/10.1145/3445814.3446701][Nightcore: efficient and scal- able serverless computing for latency-sensitive, interactive microservices]]
+ BibTex:
+ Conference: Asplos 2021
+ Cited by: 182 [2024-09-24]
+ [[][Source code]]

*** [[https://dl.acm.org/doi/10.14778/3407790.3407836][Cloudburst: Stateful functions-as-a-service]]
+ BibTex:
+ Conference: VLDB Vol. 13, No. 12
+ Cited by: 304 [2024-09-24]
+ [[][Source code]]

*** [[https://www.usenix.org/conference/osdi18/presentation/klimovic][Pocket: Elastic ephemeral storage for serverless analytics]]
+ BibTex:
+ Conference: OSDI 2018
+ Cited by: 403 [2024-09-24]
+ [[][Source code]]
** Security
*** [[https://dl.acm.org/doi/10.1145/3652024.3665509][Supporting Trusted Virtual Machines with Hardware-Based Secure Remote Memory]]
+ BibTex: [[id:FEF8408E-C424-48C1-9AF9-770C3EBE3D84][heo2024supporting]]
+ Conference: ISMM 2024
+ Cited by: 0 [2024-09-21]
+ [[][Source code]]

** [[https://ieeexplore.ieee.org/document/10476444][Salus: Efficient Security Support for CXL-Expanded GPU Memory]]
+ BibTex:
+ Conference:
+ Cited by: 1 [2024-09-25]
+ [[][Source code]]

*** [[][FaasCache: Keeping Serverless Computing Alive with Greedy-Dual Caching]]
+ BibTex:
+ Conference:
+ Created: [2024-09-26 13:51:23]
+ Cited by: 178 [2024-09-26]
+ [[][Source code]]
** Disaggregation
*** [[https://dl.acm.org/doi/10.1145/3617232.3624857][Scaling Up Memory Disaggregated Applications with SMART]]
+ BibTex:
+ Conference: Asplos 2024
+ Cited by: 0 [2024-09-24]
+ [[][Source code]]

*** [[https://dl.acm.org/doi/10.1145/3582016.3582031][Towards an Adaptable Systems Architecture for Memory Tiering at Warehouse-Scale]]
+ BibTex: [[id:8A703ABD-ED64-42F6-AA9B-438C031CF0EC][duraisamy2023adaptable]]
+ Conference: Asplos 2023
+ Cited by: 35 [2024-09-25]
+ [[][Source code]]

*** [[https://www.usenix.org/conference/atc22/presentation/gouk][Direct Access, High-Performance Memory Disaggregation with DirectCXL]]
:LOGBOOK:
CLOCK: [2024-09-26 Thu 13:10]--[2024-09-26 Thu 13:48] =>  0:38
:END:
+ BibTex:
+ Conference: ATC 2022
+ Created: [2024-09-26 02:47:56]
+ Cited by: 128 [2024-09-26]
+ [[][Source code]]

*** [[https://dl.acm.org/doi/10.1145/3445814.3446757][faascache: keeping serverless computing alive with greedy-dual caching]]
:LOGBOOK:
CLOCK: [2024-09-26 Thu 16:59]--[2024-09-26 Thu 17:53] =>  0:54
:END:
+ BibTex:
+ Conference: Asplos 2021
+ Created: [2024-09-26 16:56:20]
+ Cited by: 178 [2024-09-26]
+ [[][Source code]]


*** [[https://dl.acm.org/doi/10.1145/3342195.3392698][SEUSS: skip redundant paths to make serverless fast]]
:LOGBOOK:
CLOCK: [2024-09-27 Fri 10:47]--[2024-09-27 Fri 12:02] =>  1:15
CLOCK: [2024-09-26 Thu 20:04]--[2024-09-26 Thu 21:01] =>  0:57
CLOCK: [2024-09-26 Thu 18:23]--[2024-09-26 Thu 19:03] =>  0:40
:END:
+ BibTex: [[id:2E244C18-786F-4328-8FA2-4068CB34D8B4][cadden2020seuss]]
+ Conference: EuroSys 2020
+ Created: [2024-09-26 18:21:17]
+ Cited by: 158 [2024-09-26]
+ [[][Source code]]

Replayable execution optimized for page sharing for a managed runtime en- vironment
SOCK: Rapid Task Provisioning with Serverless- Optimized Containers
SAND: Towards High-Performance Serverless Computing

*** [[https://dl.acm.org/doi/abs/10.1145/3342195.3387522][Can far memory improve job throughput]]
+ BibTex:
+ Conference: EuroSys 2020
+ Created: [2024-09-26 22:15:02]
+ Cited by: 204 [2024-09-26]
+ [[][Source code]]


*** [[https://arxiv.org/abs/2403.18702v2][NeoMem: Hardware/Software Co-Design for CXL-Native Memory Tiering]]
:LOGBOOK: 
CLOCK: [2024-09-27 Fri 19:02]
CLOCK: [2024-09-27 Fri 15:02]--[2024-09-27 Fri 15:30] =>  0:28
:END:
+ BibTex: [[id:94012D66-221A-4511-A642-FFBB26C4CF7D][zhou2024neomem]]
+ Conference:
+ Created: [2024-09-27 10:43:34]
+ Cited by: 0 [2024-09-27]
+ [[][Source code]]
** Eco
*** [[][Designing Cloud Servers for Lower Carbon]]
+ BibTex:
+ Conference:
+ Cited by: 4 [2024-09-24]
+ [[][Source code]]

*** [[https://ieeexplore.ieee.org/document/10609689][Designing Cloud Servers for Lower Carbon]]
+ BibTex:
+ Conference: ISCA 2024
+ Cited by: 4 [2024-09-24]
+ [[][Source code]]

  
*** [[https://www.usenix.org/conference/nsdi17/technical-sessions/presentation/gu][Efficient memory disaggregation with infiniswap]]
+ BibTex:
+ Conference: NSDI 2017
+ Created: [2024-09-26 22:26:30]
+ Cited by: 463 [2024-09-26]
+ [[][Source code]]
